In [58]:
# !pip install pandas

In [59]:
%matplotlib

import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

Using matplotlib backend: Qt5Agg

## General Python

### 1.	Given the list of basket values, do the following:  
    a.	Print out whether each basket is small (basket value < £5), medium (£5 ≤ basket value < £10) or large (basket value ≥ £10); 
    
    b.	Sum and print the value of the medium value baskets.

In [101]:
values_dict = {}
x_med_val = []

def values(basket_values):
    for x in basket_values:
        if x<5:
            values_dict[x] = 'Small'
        elif x>10:
            values_dict[x] = 'Large'
        else:
            values_dict[x] ='Medium'
            x_med_val.append(x)
    return values_dict, sum(x_med_val)

In [102]:
basket_values = [3.43, 9.73, 7.56, 9.52, 15.23, 2.25,6.44,7.38]

In [103]:
val, med = values(basket_values)
print(val)
print(f'The sum of the value of the medium value baskets is {med}')

{3.43: 'Small', 9.73: 'Medium', 7.56: 'Medium', 9.52: 'Medium', 15.23: 'Large', 2.25: 'Small', 6.44: 'Medium', 7.38: 'Medium'}
The sum of the value of the medium value baskets is 40.63

### 2.	You are given the following nested dictionaries, which represent items in a basket.  Do the following:  

    a.	Return the product name for item 7527. 
    b.	Return the total value of this basket. 
    
    c.	Add another entry for a product that costs £4.95, has ID 7524 and name ‘poppy seeds’. 
    
    ``basket = {'2624': {'price': 0.5, 'prod_name': 'salt'},'2894': {'price': 3.25, 'prod_name': 'yeast'}, '7527': {'price': 2.5, 'prod_name': 'flour'}}``

In [104]:
basket = {'2624': {'price': 0.5, 'prod_name': 'salt'},
          '2894': {'price': 3.25, 'prod_name': 'yeast'}, 
          '7527': {'price': 2.5, 'prod_name': 'flour'}}

In [105]:
def get_val(dct, *keys):
    for key in keys:
        try:
            dct = dct[key]
        except KeyError:
            return None
    return dct

In [106]:
get_val(basket, '7527', 'prod_name')

'flour'

In [107]:

# basket['7524'] ={}
# basket['7524']['price'] = 4.95
# basket['7524']['prod_name'] = 'poppy seeds'

# print (basket)

In [110]:
def add_values(dct, key1, key2, key3):
    dct[key1] ={}
    dct[key1]['price'] = key2
    dct[key1]['prod_name'] = key3
    return dct

In [111]:
add_values(basket, '7524', 4.95, 'poppy_seeds')

{'2624': {'price': 0.5, 'prod_name': 'salt'},
 '2894': {'price': 3.25, 'prod_name': 'yeast'},
 '7527': {'price': 2.5, 'prod_name': 'flour'},
 '7524': {'price': 4.95, 'prod_name': 'poppy_seeds'}}

### 3.	Below is the source code for a function called ‘get_sql_string’. 

``1   def get_sql_string(stores):
2      store_names = [x.split(', ')[0] for x in stores]
3      store_names = [x.replace(' ', '_') for x in store_names]
4      store_regions = [x.split(',')[1] for x in stores]
5      locations = store_names + store_regions
6      columns = ['sales_' + x.lower() for x in locations]
7      return ', '.join(columns)``


a.	There is a bug in line 4. What should the line be? 

b.	Assuming this bug was fixed, what would be returned if the following command was executed: 

``my_stores = ['Fulham Palace Rd, Hammersmith', 'Crown St, Reading', 'Leavesden Green, Watford'] 
get_sql_string(my_stores)``

In [125]:
def get_sql_string(stores):
    store_names = [x.split(', ')[0] for x in stores]
    store_names = [x.replace(' ', '_') for x in store_names]
    store_regions = [x.split(',')[1] for x in stores]
    locations = store_names + store_regions
    columns = ['sales_' + x.lower() for x in locations]
    return ', '.join(columns)

In [146]:
my_stores = ['Fulham Palace Rd, Hammersmith', 'Crown St, Reading', 'Leavesden Green, Watford'] 

get_sql_string(my_stores)

'sales_fulham_palace_rd, sales_crown_st, sales_leavesden_green, sales_ hammersmith, sales_ reading, sales_ watford'

### 4.	Write a function that:

a.	accepts a list of strings as input.

b.	returns an alphabetically ordered list of unique strings. 

c.	prints the string(s) with maximum length in the console.

In [269]:
def printArraystring(string, n):
    for i in range(n):
        print(string[i], end = " ")
 
# Function to Sort the array of string
# according to lengths. This function
# implements Insertion Sort.
def sort(s, n):
    for i in range(1, n):
        temp = s[i]
 
        # Insert s[j] at its correct position
        j = i - 1
        while j >= 0 and len(temp) < len(s[j]):
            s[j + 1] = s[j]
            j -= 1
 
        s[j + 1] = temp
 
# Driver code
if __name__ == "__main__":
    arr = ['Fulham Palace Rd, Hammersmith', 'Crown St, Reading', 'Leavesden Green, Watford']
    n = len(arr)
 
    # Function to perform sorting
    sort(arr, n)
 
    # Calling the function to print result
    printArraystring(arr, n)

Crown St, Reading Leavesden Green, Watford Fulham Palace Rd, Hammersmith

## Section 2: pandas/SQL data frames

- Suppose you have access to two data frames, ``dept`` and ``employee``. The first three rows of these are represented below.


### QUESTIONS
1.	Find the nth largest salary. 
2.	List the highest salary paid for each job.
3.	In which year did most people join the company?  Display the year and the number of Employees. 
4.	Create a new column with the length of service of the Employees (in the form n years and m months).

 Before make the queries I will merge both employee and dept dataframes using ``DEPTNO`` column

``dataframe = pd.merge(employee, dept, on="DEPTNO")``

In [235]:
dataframe = pd.read_csv('employees.csv')
dataframe['HIREDATE']= pd.to_datetime(dataframe['HIREDATE'])     
dataframe.head()

   EMPNO     NAME        JOB     MNGR   HIREDATE   SAL
0  68319  KAYLING  PRESIDENT      NaN 1991-11-18  6000
1  66928    BLAZE    MANAGER  68319.0 1991-05-01  2750
2  67832    CLARE    MANAGER  68319.0 1991-06-09  2550
3  65646    JONAS    MANAGER  68319.0 1991-04-02  2957
4  67858  SCARLET    ANALYST  65646.0 1997-04-19  3100

In [236]:
# Answer Q1: I have create a function to query the nth_max salary

def n_salary(dataframe,nth):
    nth_max_salary=dataframe.sort_values('SAL',ascending=False)['SAL'].loc[nth]
    return nth_max_salary

#ex to query:
third_max_salary = n_salary(dataframe,3)
print(third_max_salary)

2957

In [237]:
# Answer Q2:
# in SQL ``SELECT MAX(SAL) FROM employee GROUP BY JOB``
# in pandas

result = dataframe.groupby('JOB').apply(lambda x: x[x['SAL'] == x['SAL'].max()])
result

              EMPNO     NAME        JOB     MNGR   HIREDATE   SAL
JOB
ANALYST   4   67858  SCARLET    ANALYST  65646.0 1997-04-19  3100
          5   69062    FRANK    ANALYST  65646.0 1991-12-03  3100
CLERK     13  69324   MARKER      CLERK  67832.0 1992-01-23  1400
MANAGER   3   65646    JONAS    MANAGER  68319.0 1991-04-02  2957
PRESIDENT 0   68319  KAYLING  PRESIDENT      NaN 1991-11-18  6000
SALESMAN  7   64989   ADELYN   SALESMAN  66928.0 1991-02-20  1700

In [238]:
# Answer Q3:
# in SQL

dataframe['YEAR'] = dataframe['HIREDATE'].dt.year
dataframe['YEAR'].value_counts()

1991    10
1997     2
1992     1
1990     1
Name: YEAR, dtype: int64

In [239]:
# !pip install python-dateutil

In [268]:
#Answer Q4:
#First I will make sure the 'HIREDATE' column is in a known timestamp format
import datetime
from dateutil.relativedelta import relativedelta

def serv_time(hiredate):
    today = datetime.date.today()
    service = relativedelta(date.today(), hiredate)
    return service.years, service.months


dataframe['SERVICE_LEN'] = dataframe['HIREDATE'].apply(lambda x: serv_time(x))

dataframe.head()

   EMPNO     NAME        JOB     MNGR   HIREDATE   SAL  YEAR SERVICE_LEN
0  68319  KAYLING  PRESIDENT      NaN 1991-11-18  6000  1991     (29, 8)
1  66928    BLAZE    MANAGER  68319.0 1991-05-01  2750  1991     (30, 3)
2  67832    CLARE    MANAGER  68319.0 1991-06-09  2550  1991     (30, 2)
3  65646    JONAS    MANAGER  68319.0 1991-04-02  2957  1991     (30, 4)
4  67858  SCARLET    ANALYST  65646.0 1997-04-19  3100  1997     (24, 3)